home/.emacs.d/config.org
#+TITLE: My Emacs Configuration
#+AUTHOR: Michael Utz
#+EMAIL: michael@theutz.com
#+DESCRIPTION: This document contains my entire Emacs configuration.
#+LANGUAGE: en
#+STARTUP: overview hideblocks

* Constants

   #+BEGIN_SRC emacs-lisp
     (defconst utz-dotfiles-dir (expand-file-name ".dotfiles" "~"))
   #+END_SRC

   #+BEGIN_SRC emacs-lisp
     (defconst utz-init-file (expand-file-name "init.el" user-emacs-directory))
   #+END_SRC

   #+BEGIN_SRC emacs-lisp
     (defconst utz-custom-file (expand-file-name "custom.el" user-emacs-directory))
   #+END_SRC
  
   #+BEGIN_SRC emacs-lisp
     (defconst utz-config-file (expand-file-name "config.org" user-emacs-directory))
   #+END_SRC
  
   #+BEGIN_SRC emacs-lisp
     (defconst utz-snippets-directory (expand-file-name "snippets" user-emacs-directory))
   #+END_SRC

* Emacs Settings

** Initialize Server

   #+BEGIN_SRC emacs-lisp
     ;; (server-start)
   #+END_SRC
   
** File Association
   
*** sh-mode

    #+BEGIN_SRC emacs-lisp
      (add-to-list 'auto-mode-alist '("\\.zpreztorc\\'" . sh-mode))
      (add-to-list 'auto-mode-alist '("\\zpreztorc\\'" . sh-mode))
      (add-to-list 'auto-mode-alist '("\\.zprofile\\'" . sh-mode))
      (add-to-list 'auto-mode-alist '("\\zprofile\\'" . sh-mode))
      (add-to-list 'auto-mode-alist '("\\zshenv\\'" . sh-mode))
      (add-to-list 'auto-mode-alist '("\\zshrc\\'" . sh-mode))
    #+END_SRC

** Custom File

   #+BEGIN_SRC emacs-lisp
     (setq custom-file utz-custom-file)
     (load custom-file)
   #+END_SRC

** Minor Modes
   
*** Tool Bar Mode

    #+BEGIN_SRC emacs-lisp
     (tool-bar-mode 0)
    #+END_SRC
  
*** Menu Bar Mode
   
    #+BEGIN_SRC emacs-lisp
     (menu-bar-mode 0)
    #+END_SRC
  
*** Show Paren Mode 

    #+BEGIN_SRC emacs-lisp
     (show-paren-mode 1)
    #+END_SRC

*** Global Display Line Numbers Mode   

    #+BEGIN_SRC emacs-lisp
     (global-display-line-numbers-mode 1)
    #+END_SRC
   
*** Scroll Bar Mode
   
    #+BEGIN_SRC emacs-lisp
     (scroll-bar-mode 0)
    #+END_SRC
   
** Variables

*** Setup UTF-8

   #+BEGIN_SRC emacs-lisp
     (setq-default buffer-file-coding-system 'utf-8-unix)
     (set-default-coding-systems 'utf-8-unix)
     (setq locale-coding-system 'utf-8-unix)
     (prefer-coding-system 'utf-8-unix)
     (set-terminal-coding-system 'utf-8-unix)
   #+END_SRC

*** Org Confirm Babel Evaluate
    
   #+BEGIN_SRC emacs-lisp
    (setq org-confirm-babel-evaluate nil)
   #+END_SRC
  
*** Inhibit Startup Screen
    
    #+BEGIN_SRC emacs-lisp
      (setq inhibit-startup-screen t)
    #+END_SRC
   
*** Initial Scratch Message
    
    #+BEGIN_SRC emacs-lisp
      (setq initial-scratch-message nil)
    #+END_SRC
    
*** Display Line Numbers Type

    #+BEGIN_SRC emacs-lisp
      (setq display-line-numbers-type 'visual)
    #+END_SRC
    
*** VC Follow Symlinks
    
    #+BEGIN_SRC emacs-lisp
      (setq vc-follow-symlinks t)
    #+END_SRC

*** Narrow to Region

    #+BEGIN_SRC emacs-lisp
      (put 'narrow-to-region 'disabled nil)
    #+END_SRC

*** Tab Width

    #+BEGIN_SRC emacs-lisp
      (setq-default indent-tabs-mode 2)
    #+END_SRC

* Packages

** General.el

  #+BEGIN_SRC emacs-lisp
    (use-package general)
  #+END_SRC

** Magit

   #+BEGIN_SRC emacs-lisp
     (use-package magit)
   #+END_SRC

*** Forge
    
    #+BEGIN_SRC emacs-lisp
      (use-package forge
	:after magit)
    #+END_SRC

*** Magit TODOs

    #+BEGIN_SRC emacs-lisp
      (use-package magit-todos
	:after magit
	:hook '(magit . magit-todos))
    #+END_SRC
    
** Org Mode
*************** TODO Setup capture templates

   #+BEGIN_SRC emacs-lisp
     (use-package org
       :init
       (setq org-directory (expand-file-name "~/org")
	     org-archive-location (expand-file-name "archive.org" org-directory)
	     org-default-notes-file (expand-file-name "inbox.org" org-directory)
	     org-capture-templates '(("t" "Todo" entry (file org-default-notes-file)
				      "* TODO %?\n\t%i\n\t%a")))
       :config
       (require 'org-inlinetask))
   #+END_SRC
   
*** Org Bullets

    #+BEGIN_SRC emacs-lisp
      (use-package org-bullets
	:hook (org-mode . (lambda () (org-bullets-mode 1))))
    #+END_SRC

*** Org Rifle

    #+BEGIN_SRC emacs-lisp
      (use-package helm-org-rifle)
    #+END_SRC

** Evil

  #+BEGIN_SRC emacs-lisp
    (use-package evil
      :init
      (setq evil-want-integration t
	    evil-want-keybinding nil
	    evil-want-C-u-scroll t
	    evil-split-window-below nil
	    evil-shift-width 2)
      :config
      (evil-mode 1))
  #+END_SRC

*** Evil Org

    #+BEGIN_SRC emacs-lisp
      (with-eval-after-load 'evil
	(straight-use-package 'evil-org)
	(require 'evil-org)
	(add-hook 'org-mode-hook 'evil-org-mode)
	(add-hook 'evil-org-mode-hook
		  (lambda ()
		    (evil-org-set-key-theme)))
	(require 'evil-org-agenda)
	(evil-org-agenda-set-keys))
    #+END_SRC

*** Evil Surround

    #+BEGIN_SRC emacs-lisp
      (with-eval-after-load 'evil
	(straight-use-package 'evil-surround)
	(require 'evil-surround)
	(global-evil-surround-mode 1))
    #+END_SRC

*** Evil Magit

    #+BEGIN_SRC emacs-lisp
      (with-eval-after-load 'evil
	(with-eval-after-load 'magit
	  (straight-use-package 'evil-magit)
	  (require 'evil-magit)))
    #+END_SRC

*** Evil Treemacs

    #+BEGIN_SRC emacs-lisp
      (straight-use-package 'treemacs-evil)
      (with-eval-after-load 'evil
        (with-eval-after-load 'treemacs
          (require 'treemacs-evil)))
    #+END_SRC

*** Evil Collection

    #+BEGIN_SRC emacs-lisp
      (straight-use-package 'evil-collection)
      (require 'evil-collection)
      (evil-collection-init)
    #+END_SRC

*** Evil Commentary

    #+BEGIN_SRC emacs-lisp
      (straight-use-package 'evil-commentary)
      (require 'evil-commentary)
      (evil-commentary-mode)
    #+END_SRC
    
** YASnippet

  #+BEGIN_SRC emacs-lisp
    (straight-use-package 'yasnippet)
    (require 'yasnippet)
    (setq yas-snippet-dirs '(utz-snippets-directory))
    (setq yas-verbosity 2)
    (yas-global-mode 1)
  #+END_SRC

** Git Gutter

   #+BEGIN_SRC emacs-lisp
     (use-package git-gutter
       :config
       (global-git-gutter-mode +1))
   #+END_SRC

** Projectile

   #+BEGIN_SRC emacs-lisp
     (use-package projectile
       :general
       (:keymaps '(projectile-mode-map) "s-p" 'projectile-command-map)
       :config
       (projectile-mode +1))
   #+END_SRC

** LSP Mode

   #+BEGIN_SRC emacs-lisp
     (use-package lsp-mode
       :init (setq lsp-keymap-prefix "s-l")
       :hook ((lsp-mode . lsp-enable-which-key-integration)
	      (web-mode . lsp-mode))
       :commands (lsp))
   #+END_SRC

*** LSP UI

    #+BEGIN_SRC emacs-lisp
      (use-package lsp-ui
	:commands (lsp-ui-mode)
	:config
	(add-to-list 'lsp-ui-doc-frame-parameters '(no-accept-focus . t)))
    #+END_SRC

*** Helm LSP

    #+BEGIN_SRC emacs-lisp
      (use-package helm-lsp
	:commands (helm-lsp-workspace-symbol))
    #+END_SRC

*** LSP Treemacs

    #+BEGIN_SRC emacs-lisp
      (use-package lsp-treemacs
	:commands lsp-treemacs-errors-list)
    #+END_SRC

** Web Mode

   Setup [[http://web-mode.org/][Web Mode]] for emacs.

   #+BEGIN_SRC emacs-lisp
     (use-package web-mode
       :init
       (setq web-mode-code-indent-offset 2)
       :mode
       ("\\.html?\\'" . web-mode)
       ("\\.jsx?\\'" . web-mode)
       ("\\.tsx?\\'" . web-mode)
       ("\\.json\\'" . web-mode))
   #+END_SRC

** vterm

   #+BEGIN_SRC emacs-lisp
     (use-package vterm
       :init
       (setq vterm-kill-buffer-on-exit t)
       :config
       (add-hook 'vterm-mode-hook (lambda ()
				    (setq-local evil-insert-state-cursor 'box)
				    (evil-insert-state))))
   #+END_SRC

*** multi-vterm

    #+BEGIN_SRC emacs-lisp
      (use-package multi-vterm
	:after vterm)
    #+END_SRC
   
** Flycheck

  #+BEGIN_SRC emacs-lisp
    (use-package flycheck
      :after (exec-path-from-shell)
      :config
      (global-flycheck-mode))
  #+END_SRC

** Exec Path from Shell

   #+BEGIN_SRC emacs-lisp
     (use-package exec-path-from-shell
       :config
       (exec-path-from-shell-initialize))
   #+END_SRC

** Restart Emacs

  #+BEGIN_SRC emacs-lisp
    (straight-use-package 'restart-emacs)
    (require 'restart-emacs)
  #+END_SRC

** Company

 #+BEGIN_SRC emacs-lisp
    (use-package company
      :hook (after-init . global-company-mode))
  #+END_SRC

*** Company Box

    #+BEGIN_SRC emacs-lisp
      (use-package company-box
	:hook (company-mode . company-box-mode))
    #+END_SRC

** Helm

   #+BEGIN_SRC emacs-lisp
     (use-package helm
       :config
       (helm-mode 1))
   #+END_SRC

*** Helm Projectile

    #+BEGIN_SRC emacs-lisp
      (use-package helm-projectile
	:config
	(helm-projectile-on))
    #+END_SRC

*** Helm Ag

    #+BEGIN_SRC emacs-lisp
      (use-package helm-ag
	:after (helm exec-path-from-shell))
    #+END_SRC

** Which Key

   #+BEGIN_SRC emacs-lisp
     (use-package which-key
       :config
       (which-key-setup-side-window-bottom)
       (which-key-mode))
   #+END_SRC

** Prettier JS

   #+BEGIN_SRC emacs-lisp
     (use-package prettier-js
       :hook (web-mode . prettier-js-mode))
   #+END_SRC

** Add node_modules Path

   #+BEGIN_SRC emacs-lisp
     (use-package add-node-modules-path
       :hook (web-mode . add-node-modules-path))
   #+END_SRC

** All The Icons

   #+BEGIN_SRC emacs-lisp
     (straight-use-package 'all-the-icons)
     (require 'all-the-icons)
   #+END_SRC

** Treemacs

   #+BEGIN_SRC emacs-lisp
     (use-package treemacs
       :config
       (treemacs-git-mode 'deferred))
   #+END_SRC
   
*** Treemacs Projectile

    #+BEGIN_SRC emacs-lisp
      (use-package treemacs-projectile
	:after (treemacs projectile))
    #+END_SRC

** Helpful

   #+BEGIN_SRC emacs-lisp
     (straight-use-package 'helpful)
     (require 'helpful)
   #+END_SRC

** Finder+

   #+BEGIN_SRC emacs-lisp
     (use-package finder+)
   #+END_SRC

** Theme

   #+BEGIN_SRC emacs-lisp
     (straight-use-package 'doom-themes)
     (require 'doom-themes)
     (setq doom-themes-enable-bold t
	   doom-themes-enable-italic t)
     (load-theme 'doom-one t)

     (doom-themes-visual-bell-config)
     (doom-themes-org-config)
     (with-eval-after-load 'treemacs
       (doom-themes-treemacs-config))
   #+END_SRC

* Macros
** Keymaps

   Set the main leader to =SPC=.
   
   #+BEGIN_SRC emacs-lisp
     (general-create-definer utz/set-leader-key
       :prefix "SPC"
       :keymaps '(normal emacs visual))
   #+END_SRC

   Set the local leader key to =,=.

   #+BEGIN_SRC emacs-lisp
     (general-create-definer utz/set-localleader-key
       :prefix ","
       :non-normal-prefix "M-,")
   #+END_SRC
   
** Commands

  #+BEGIN_SRC emacs-lisp
	(defmacro utz/find-config-file (name shortcut-key file)
	  "A macro for creating commands that open configuration files.

    NAME should represent the configuration file, e.g. `zshrc' or `emacs'.
    SHORTCUT-KEY will be appended to the `:infix' for \[utz/set-leader-key].
    FILE is the absolute path that should be opened.

    \(fn NAME SHORTCUT-KEY FILE)"
	  (let ((funsymbol (intern (format "utz/find-config-%s" name)))
		(doc (format "Open %s configuration file.\n`C-u' for a new window.\n`C-u C-u' for a new frame." name))
		(shortcut (format "f c %s" shortcut-key)))
	    `(progn
	       (defun ,funsymbol (arg) ,doc
		      (interactive "P")
		      (cond ((equal '(4) arg) (find-file-other-window ,file))
			    ((equal '(16) arg) (find-file-other-frame ,file))
			    (t (find-file ,file))))
	       (utz/set-leader-key ,shortcut '(,funsymbol :wk ,name)))))
  #+END_SRC
   
* Functions

** Reload Emacs Configuration File

   #+BEGIN_SRC emacs-lisp
     (defun utz/load-config-file (arg)
	"(Re)load emacs with a fresh configuration file."
	(interactive "P")
	(cond ((equal '(4) arg) (load-file utz-init-file))
	      (t (org-babel-load-file utz-config-file))))
	;; (let ((file (cond ((equal '(4) arg) utz-init-file)
	;; 		     (t utz-config-file))))
	;;   (message file)
	;;   (load-file file)))
   #+END_SRC
    
** Edit Configuration Files

*** Emacs Configuration

    Open /this/ file.

    #+BEGIN_SRC emacs-lisp
      (utz/find-config-file "emacs" "e" utz-config-file)
    #+END_SRC

*** Emacs Custom

    Open the ~custom.el~ file where Easy Customization settings are saved.
    
    #+BEGIN_SRC emacs-lisp
      (utz/find-config-file "emacs-custom" "," utz-custom-file)
    #+END_SRC

*** Emacs Init

    Open the ~init.el~ that bootstraps emacs.
    
    #+BEGIN_SRC emacs-lisp
      (utz/find-config-file "emacs-init" "i" utz-init-file)
    #+END_SRC
     
*** SKHD

    Open the configuration file for [[https://github.com/koekeishiya/skhd][skhd]].

    #+BEGIN_SRC emacs-lisp
      (utz/find-config-file "skhd" "s" (expand-file-name "home/.config/skhd/skhdrc" utz-dotfiles-dir))
    #+END_SRC

*** Yabai

    Open the configuration file for [[https://github.com/koekeishiya/yabai/wiki][yabai]].

    #+BEGIN_SRC emacs-lisp
      (utz/find-config-file "yabai" "y" (expand-file-name "home/.config/yabai/yabairc" utz-dotfiles-dir))
    #+END_SRC

*** ZSH

    Open the runtime configuration for zsh.
     
   #+BEGIN_SRC emacs-lisp
     (utz/find-config-file "zshrc" "z" (expand-file-name ".zshrc" "~"))
   #+END_SRC

** Miscellaneous
    
   #+BEGIN_SRC emacs-lisp
     (defun utz/delete-frame ()
       "Delete the selected frame."
       (interactive)
       (condition-case nil (delete-frame) (error (save-buffers-kill-terminal))))
   #+END_SRC

* Keymaps

** Global

   #+BEGIN_SRC emacs-lisp
     (general-define-key "s-q" 'utz/delete-frame
			 "C-q" 'kill-emacs)
   #+END_SRC

** Leader

   Setup shortcuts that occur at the top-level of the leader keymap.
   
   #+BEGIN_SRC emacs-lisp
     (utz/set-leader-key
       "" '(:ignore t :wk "Leader")
       "u" '(universal-argument :wk "Universal Argument")
       "h" `(,(general-simulate-key "C-h") :wk "Help")
       "SPC" '(helm-M-x :wk "M-x"))
   #+END_SRC

   And allow =SPC u= to be pressed multiple times, adding additional universal arguments.
   
   #+BEGIN_SRC emacs-lisp
     (utz/set-leader-key
       :keymaps '(universal-argument-map)
       "u" '(universal-argument-more :wk "Universal Argument (more...)"))
   #+END_SRC

*** b - Buffers

    #+BEGIN_SRC emacs-lisp
      (utz/set-leader-key :infix "b"
	"" '(:ignore t :wk "Buffer")
	"b" '(helm-buffers-list :wk "List Buffers")
	"d" '(kill-this-buffer :wk "Delete Buffer")
	"n" '(next-buffer :wk "Next buffer")
	"p" '(previous-buffer :wk "Previous Buffer"))
    #+END_SRC

    #+RESULTS:

*** f - Files

    #+BEGIN_SRC emacs-lisp
      (utz/set-leader-key :infix "f"
	"" '(:ignore t :wk "Files")
	"f" '(helm-projectile :wk "Find Files in Project")
	"F" '(helm-find-files :wk "Find Files")
	"s" '(save-buffer :wk "Save Buffer")
	"t" '(treemacs :wk "Treemacs"))
    #+END_SRC

*** c - Configuration Files
    
    #+BEGIN_SRC emacs-lisp
      (utz/set-leader-key :infix "f c"
	"" '(:ignore t :wk "Configuration"))
    #+END_SRC

*** F - Frames

    #+BEGIN_SRC emacs-lisp
      (utz/set-leader-key :infix "F"
	"" '(:ignore t :wk "Frames")
	"d" '(delete-frame :wk "Delete")
	"n" '(make-frame :wk "Make"))
    #+END_SRC

*** g - Git
    
    #+BEGIN_SRC emacs-lisp
      (utz/set-leader-key :infix "g"
	  "" '(:ignore t :wk "Git")
	  "b" '(magit-blame :wk "Blame")
	  "c" '(magit-commit :wk "Commit")
	  "l" '(magit-log :wk "Log")
	  "s" '(magit-stage :wk "Stage")
	  "u" '(magit-unstage :wk "Un-stage")
	  "g" '(magit-status :wk "Status"))
    #+END_SRC

*** l - Language

    #+BEGIN_SRC emacs-lisp
      (utz/set-leader-key :infix "l"
        "" '(:ignore t :wk "Language")
	"l" `(,(general-simulate-key "s-l") :wk "Language Server"))
    #+END_SRC
    
*** o - Org

    #+BEGIN_SRC emacs-lisp
      (utz/set-leader-key :infix "o"
	"" '(:ignore t :wk "Org")
	"c" '(org-capture :wk "Capture"))
    #+END_SRC

**** a - Org Agenda
    
    #+BEGIN_SRC emacs-lisp
      (utz/set-leader-key :infix "o a"
	"" '(:ignore t :wk "Agenda")
	"a" '(org-agenda :wk "Agenda"))
    #+END_SRC

**** r - Org Rifle
     
     #+BEGIN_SRC emacs-lisp
       (utz/set-leader-key :infix "o r"
	 "" '(:ignore t :wk "Rifle")
	 "r" '(helm-org-rifle :wk "Open Buffers")
	 "R" '(helm-org-rifle-occur :wk "Open Buffers (Occur)")
	 "a" '(helm-org-rifle-agenda-files :wk "Agenda Files")
	 "A" '(helm-org-rifle-occur-agenda-files :wk "Agenda Files (Occur)")
	 "b" '(helm-org-rifle-current-buffer :wk "Current Buffer")
	 "B" '(helm-org-rifle-occur-current-buffer :wk "Current Buffer (Occur)")
	 "o" '(helm-org-rifle-org-directory :wk "Org Directory")
	 "O" '(helm-org-rifle-occur-org-directory :wk "Org Directory (Occur)"))
     #+END_SRC
     
*** p - Project

    #+BEGIN_SRC emacs-lisp
      (utz/set-leader-key :infix "p"
	"" '(:ignore t :wk "Project")
	"/" '(helm-projectile-ag :wk "Search in Project")
	"f" '(helm-projectile :wk "Find file")
	"p" '(helm-projectile-switch-project :wk "Switch Project")
	"t" '(projectile-toggle-between-implementation-and-test :wk "Toggle Implementation/Test")
	"T" '(projectile-find-implementation-or-test-other-window :wk "Toggle Implementation/Test Other Window")
	"C-t" '(projectile-find-implementation-or-test-other-frame :wk "Toggle Implemenation/Test Other Frame"))
    #+END_SRC

*** q - Quit

    #+BEGIN_SRC emacs-lisp
      (utz/set-leader-key :infix "q"
	"" '(:ignore t :wk "Quit")
	"q" '(utz/delete-frame :wk "Delete Frame")
	"Q" '(kill-emacs :wk "Quit Emacs")
	"r" '(utz/load-config-file :wk "Reload Configuration")
	"R" '(restart-emacs :wk "Restart Emacs"))
    #+END_SRC

*** w - Window

    #+BEGIN_SRC emacs-lisp
      (utz/set-leader-key :infix "w"
	"" `(,(general-simulate-key "C-w") :wk "Window"))
    #+END_SRC

** Local Leader

*** vterm

    #+BEGIN_SRC emacs-lisp
      (utz/set-localleader-key
	:states '(normal)
	:keymap 'vterm-mode-map
	"c" '(multi-vterm :wk "Create New Terminal")
	"n" '(multi-vterm-next :wk "Next Terminal")
	"p" '(multi-vterm-prev :wk "Previous Terminal"))
    #+END_SRC
    
*** Org

    #+BEGIN_SRC emacs-lisp
      (utz/set-localleader-key
	:states '(normal insert)
	:keymaps '(org-mode-map)
	"'" '(org-edit-special :wk "Edit Special"))
    #+END_SRC

**** Special Edit

     #+BEGIN_SRC emacs-lisp
       (add-hook 'org-src-mode-hook
		 (lambda ()
		   (utz/set-localleader-key
		     :states '(normal)
		     :keymap 'org-src-mode-map
		     "'" '(org-edit-src-exit :wk "Exit"))))
     #+END_SRC

** Help

   #+BEGIN_SRC emacs-lisp
     (general-create-definer utz/set-help-key
       :prefix "C-h")

     (utz/set-help-key
       "f" '(helpful-callable :wk "Callable")
       "v" '(helpful-variable :wk "Variable")
       "x" '(helpful-at-point :wk "At Point")
       "k" '(helpful-at-key :wk "Key")
       "F" '(helpful-function :wk "Function")
       "c" '(helpful-command :wk "Command"))
   #+END_SRC

** Insert Mode

   #+BEGIN_SRC emacs-lisp
     (general-define-key :states '(insert) "C-SPC" 'company-complete)
   #+END_SRC

